function a = Hermite(fun, dfun, x)
%x y dy - узлы, значения функции в узлах и значения производных в узлах
%соответственно
y = [fun(x(1)) fun(x(2)) fun(x(3))];
dy = [dfun(x(1)) dfun(x(2)) dfun(x(3))];
A=[ x(1)^5 x(1)^4 x(1)^3 x(1)^2 x(1) 1; 
    5*x(1)^4 4*x(1)^3 3*x(1)^2 2*x(1) 1 0; 
    x(2)^5 x(2)^4 x(2)^3 x(2)^2 x(2) 1; 
    5*x(2)^4 4*x(2)^3 3*x(2)^2 2*x(2) 1 0;
    x(3)^5 x(3)^4 x(3)^3 x(3)^2 x(3) 1; 
    5*x(3)^4 4*x(3)^3 3*x(3)^2 2*x(3) 1 0];
B = [y(1); dy(1); y(2); dy(2); y(3); dy(3)];
a = linsolve(A,B);
end

