function a = Hermite2(fun, dfun, d2fun, x)
%x y dy - узлы, значения функции в узлах и значения производных в узлах
%соответственно
y = [fun(x(1)) fun(x(2)) fun(x(3))];
dy = [dfun(x(1)) dfun(x(2)) dfun(x(3))];
d2y = [d2fun(x(1)) d2fun(x(2)) d2fun(x(3))];
A=[ x(1)^8 x(1)^7 x(1)^6 x(1)^5 x(1)^4 x(1)^3 x(1)^2 x(1) 1; 
    8*x(1)^7 7*x(1)^6 6*x(1)^5 5*x(1)^4 4*x(1)^3 3*x(1)^2 2*x(1) 1 0;
    56*x(1)^6 42*x(1)^5 30*x(1)^4 20*x(1)^3 12*x(1)^2 6*x(1) 2 0 0;
    x(2)^8 x(2)^7 x(2)^6 x(2)^5 x(2)^4 x(2)^3 x(2)^2 x(2) 1; 
    8*x(2)^7 7*x(2)^6 6*x(2)^5 5*x(2)^4 4*x(2)^3 3*x(2)^2 2*x(2) 1 0;
    56*x(2)^6 42*x(2)^5 30*x(2)^4 20*x(2)^3 12*x(2)^2 6*x(2) 2 0 0;
    x(3)^8 x(3)^7 x(3)^6 x(3)^5 x(3)^4 x(3)^3 x(3)^2 x(3) 1; 
    8*x(3)^7 7*x(3)^6 6*x(3)^5 5*x(3)^4 4*x(3)^3 3*x(3)^2 2*x(3) 1 0;
    56*x(3)^6 42*x(3)^5 30*x(3)^4 20*x(3)^3 12*x(3)^2 6*x(3) 2 0 0];
B = [y(1); dy(1); d2y(1); y(2); dy(2);d2y(2); y(3); dy(3); d2y(3)];
a = linsolve(A,B);
end

